In [1]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [5]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df["full_name"] = df["first"] + " " + df["last"]

In [7]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

In [8]:
df.drop(columns=["first", "last"]) # Temporary change

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [9]:
df.drop(columns=["first", "last"], inplace=True) # Permanent change

In [10]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [11]:
df["full_name"].str.split(" ")

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [12]:
df["full_name"].str.split(" ", expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [13]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [14]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

In [26]:
df = pd.concat([df, pd.DataFrame([{"first": "Tony"}])], ignore_index=True) # Method 1 to add a row

In [27]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [28]:
df.loc[len(df)] = {"first": "Ian"} # Method 2 to add a row

In [29]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN    Ian      NaN

In [30]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["Tony@gmail.com", "Steve@gmail.com"]
}

In [31]:
df2 = pd.DataFrame(people)

In [32]:
df2

   first    last            email
0   Tony   Stark   Tony@gmail.com
1  Steve  Rogers  Steve@gmail.com

In [34]:
pd.concat([df, df2], ignore_index=True) # Temporary changes

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN    Ian      NaN
5           Tony@gmail.com            NaN   Tony    Stark
6          Steve@gmail.com            NaN  Steve   Rogers

In [37]:
df = pd.concat([df, df2], ignore_index=True) # Permanent changes

In [38]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN    Ian      NaN
5           Tony@gmail.com            NaN   Tony    Stark
6          Steve@gmail.com            NaN  Steve   Rogers

In [42]:
df.drop(index=6)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN    Ian      NaN
5           Tony@gmail.com            NaN   Tony    Stark

In [43]:
df.drop(index=df[df["last"] == "Doe"].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3                      NaN            NaN   Tony      NaN
4                      NaN            NaN    Ian      NaN
5           Tony@gmail.com            NaN   Tony    Stark
6          Steve@gmail.com            NaN  Steve   Rogers